doc: update the content of the doc
Signed-off-by: amitami2 <amitami2@cisco.com>
